app/views/groups/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "groups_users" ON "users"."id" = "groups_users"."user_id" WHERE "groups_users"."group_id" = ? AND "users"."user_id" = 3  [["group_id", 1]]
---
  <tbody>
    <% @group.users.each do |user| %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT "groups_users".* FROM "groups_users" WHERE "groups_users"."user_id" = ? AND "groups_users"."group_id" = ?  [["user_id", 3], ["group_id", 1]]
---
    <%= link_to 'Join', "/groups/#{@group.id}/users", :method => :post %>
  <% if GroupsUser.where(user_id: current_user.id, group_id: @group.id).present? %>