app/views/users/show.html.erb

SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = ?  [["user_id", 1]]
---
  <tbody>
    <% user_statuses = Status.where(user_id: @user.id) %>