app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @group = Group.new(group_params)

    if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Gtest1"], ["created_at", "2017-03-20 15:12:39.554975"], ["updated_at", "2017-03-20 15:12:39.554975"]]

  def add_user
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]

  def delete_user
    @group = Group.find(params[:id])
    @group.users.destroy(current_user) if logged_in?
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]

  def update
    if @group.update(group_params)
---
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "Daniels"], ["updated_at", "2017-03-20 17:55:10.409896"], ["id", 4]]

  def destroy
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]

  def set_group
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 4]]