app/controllers/statuses_controller.rb

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @status = Status.find(params[:id])

INSERT INTO "statuses" ("text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "hello"], ["user_id", 3], ["created_at", "2017-03-20 05:28:31.050792"], ["updated_at", "2017-03-20 05:28:31.050792"]]
---
  def create
    @status = Status.new(status_params)
    @status.user_id = current_user.id
    if @status.save

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "statuses" SET "text" = ?, "updated_at" = ? WHERE "statuses"."id" = ?  [["text", "test12"], ["updated_at", "2017-03-21 01:34:04.308610"], ["id", 3]]
---
  def update
    @status = Status.find(params[:id])
    if @status.update(status_params)

DELETE FROM "statuses" WHERE "statuses"."id" = ?  [["id", 1]]
---
  def destroy
    set_status
    @status.destroy

SELECT  "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_status
    @status = Status.find(params[:id])