app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "daniel"], ["password_hash", "$2a$10$O9hXWfcjnWCy2pi4HILBjOEgNXZ/xB00SKX/yzeUFozBEmtAGdkfm"], ["updated_at", "2017-03-20 03:44:51.354041"], ["id", 2]]
---
  def update
    if @user.update(user_params)